; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x))))

; problem
(define (problem BLOCKS-15-0)
(:domain BLOCKS)
(:objects A C L D J H K O N G I F B M E - block)
(:init (CLEAR E) (CLEAR M) (CLEAR B) (CLEAR F) (CLEAR I) (ONTABLE G)
 (ONTABLE N) (ONTABLE O) (ONTABLE K) (ONTABLE H) (ON E J) (ON J D) (ON D L)
 (ON L C) (ON C G) (ON M N) (ON B A) (ON A O) (ON F K) (ON I H) (HANDEMPTY))
(:goal (and (ON G O) (ON O H) (ON H K) (ON K M) (ON M F) (ON F E) (ON E A)
            (ON A B) (ON B L) (ON L J) (ON J D) (ON D N) (ON N I) (ON I C)))
)

; plan
1. (unstack e j)
   deleted: (clear e) (handempty) (on e j)
   added: (holding e) (clear j)
   goals met: 1 of 14
2. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 1 of 14
3. (unstack j d)
   deleted: (clear j) (handempty) (on j d)
   added: (holding j) (clear d)
   goals met: 0 of 14
4. (stack j e)
   deleted: (holding j) (clear e)
   added: (clear j) (handempty) (on j e)
   goals met: 0 of 14
5. (unstack d l)
   deleted: (clear d) (handempty) (on d l)
   added: (holding d) (clear l)
   goals met: 0 of 14
6. (stack d j)
   deleted: (holding d) (clear j)
   added: (clear d) (handempty) (on d j)
   goals met: 0 of 14
7. (unstack l c)
   deleted: (clear l) (handempty) (on l c)
   added: (holding l) (clear c)
   goals met: 0 of 14
8. (stack l b)
   deleted: (holding l) (clear b)
   added: (clear l) (handempty) (on l b)
   goals met: 0 of 14
9. (unstack c g)
   deleted: (clear c) (handempty) (on c g)
   added: (holding c) (clear g)
   goals met: 0 of 14
10. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 0 of 14
11. (unstack i h)
   deleted: (clear i) (handempty) (on i h)
   added: (holding i) (clear h)
   goals met: 0 of 14
12. (stack i c)
   deleted: (holding i) (clear c)
   added: (clear i) (handempty) (on i c)
   goals met: 1 of 14
13. (unstack m n)
   deleted: (clear m) (handempty) (on m n)
   added: (holding m) (clear n)
   goals met: 1 of 14
14. (stack m g)
   deleted: (holding m) (clear g)
   added: (clear m) (handempty) (on m g)
   goals met: 1 of 14
15. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 1 of 14
16. (stack n i)
   deleted: (holding n) (clear i)
   added: (clear n) (handempty) (on n i)
   goals met: 2 of 14
17. (unstack d j)
   deleted: (clear d) (handempty) (on d j)
   added: (holding d) (clear j)
   goals met: 2 of 14
18. (stack d n)
   deleted: (holding d) (clear n)
   added: (clear d) (handempty) (on d n)
   goals met: 3 of 14
19. (unstack j e)
   deleted: (clear j) (handempty) (on j e)
   added: (holding j) (clear e)
   goals met: 3 of 14
20. (stack j d)
   deleted: (holding j) (clear d)
   added: (clear j) (handempty) (on j d)
   goals met: 4 of 14
21. (unstack l b)
   deleted: (clear l) (handempty) (on l b)
   added: (holding l) (clear b)
   goals met: 4 of 14
22. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 5 of 14
23. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 5 of 14
24. (stack b l)
   deleted: (holding b) (clear l)
   added: (clear b) (handempty) (on b l)
   goals met: 6 of 14
25. (unstack a o)
   deleted: (clear a) (handempty) (on a o)
   added: (holding a) (clear o)
   goals met: 6 of 14
26. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 7 of 14
27. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 7 of 14
28. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 8 of 14
29. (unstack f k)
   deleted: (clear f) (handempty) (on f k)
   added: (holding f) (clear k)
   goals met: 8 of 14
30. (stack f e)
   deleted: (holding f) (clear e)
   added: (clear f) (handempty) (on f e)
   goals met: 9 of 14
31. (unstack m g)
   deleted: (clear m) (handempty) (on m g)
   added: (holding m) (clear g)
   goals met: 9 of 14
32. (stack m f)
   deleted: (holding m) (clear f)
   added: (clear m) (handempty) (on m f)
   goals met: 10 of 14
33. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 10 of 14
34. (stack k m)
   deleted: (holding k) (clear m)
   added: (clear k) (handempty) (on k m)
   goals met: 11 of 14
35. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 11 of 14
36. (stack h k)
   deleted: (holding h) (clear k)
   added: (clear h) (handempty) (on h k)
   goals met: 12 of 14
37. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 12 of 14
38. (stack o h)
   deleted: (holding o) (clear h)
   added: (clear o) (handempty) (on o h)
   goals met: 13 of 14
39. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 13 of 14
40. (stack g o)
   deleted: (holding g) (clear o)
   added: (clear g) (handempty) (on g o)
   goals met: 14 of 14
